trol73/avr-make/asm/include/ATxmega128B3def.inc
.equ PORTM_DIR = 1888		// I/O Port Data Direction
.equ PORTM_DIRSET = 1889		// I/O Port Data Direction Set
.equ PORTM_DIRCLR = 1890		// I/O Port Data Direction Clear
.equ PORTM_DIRTGL = 1891		// I/O Port Data Direction Toggle
.equ PORTM_OUT = 1892		// I/O Port Output
.equ PORTM_OUTSET = 1893		// I/O Port Output Set
.equ PORTM_OUTCLR = 1894		// I/O Port Output Clear
.equ PORTM_OUTTGL = 1895		// I/O Port Output Toggle
.equ PORTM_IN = 1896		// I/O port Input
.equ PORTM_INTCTRL = 1897		// Interrupt Control Register
.equ PORTM_INT0MASK = 1898		// Port Interrupt 0 Mask
.equ PORTM_INT1MASK = 1899		// Port Interrupt 1 Mask
.equ PORTM_INTFLAGS = 1900		// Interrupt Flag Register
.equ PORTM_REMAP = 1902		// I/O Port Pin Remap Register
.equ PORTM_PIN0CTRL = 1904		// Pin 0 Control Register
.equ PORTM_PIN1CTRL = 1905		// Pin 1 Control Register
.equ PORTM_PIN2CTRL = 1906		// Pin 2 Control Register
.equ PORTM_PIN3CTRL = 1907		// Pin 3 Control Register
.equ PORTM_PIN4CTRL = 1908		// Pin 4 Control Register
.equ PORTM_PIN5CTRL = 1909		// Pin 5 Control Register
.equ PORTM_PIN6CTRL = 1910		// Pin 6 Control Register
.equ PORTM_PIN7CTRL = 1911		// Pin 7 Control Register

;***************************************************************************
;** PORTR - I/O Port R
;***************************************************************************
	
.equ PORTR_DIR = 2016		// I/O Port Data Direction
.equ PORTR_DIRSET = 2017		// I/O Port Data Direction Set
.equ PORTR_DIRCLR = 2018		// I/O Port Data Direction Clear
.equ PORTR_DIRTGL = 2019		// I/O Port Data Direction Toggle
.equ PORTR_OUT = 2020		// I/O Port Output
.equ PORTR_OUTSET = 2021		// I/O Port Output Set
.equ PORTR_OUTCLR = 2022		// I/O Port Output Clear
.equ PORTR_OUTTGL = 2023		// I/O Port Output Toggle
.equ PORTR_IN = 2024		// I/O port Input
.equ PORTR_INTCTRL = 2025		// Interrupt Control Register
.equ PORTR_INT0MASK = 2026		// Port Interrupt 0 Mask
.equ PORTR_INT1MASK = 2027		// Port Interrupt 1 Mask
.equ PORTR_INTFLAGS = 2028		// Interrupt Flag Register
.equ PORTR_REMAP = 2030		// I/O Port Pin Remap Register
.equ PORTR_PIN0CTRL = 2032		// Pin 0 Control Register
.equ PORTR_PIN1CTRL = 2033		// Pin 1 Control Register
.equ PORTR_PIN2CTRL = 2034		// Pin 2 Control Register
.equ PORTR_PIN3CTRL = 2035		// Pin 3 Control Register
.equ PORTR_PIN4CTRL = 2036		// Pin 4 Control Register
.equ PORTR_PIN5CTRL = 2037		// Pin 5 Control Register
.equ PORTR_PIN6CTRL = 2038		// Pin 6 Control Register
.equ PORTR_PIN7CTRL = 2039		// Pin 7 Control Register

;***************************************************************************
;** TCC0 - Timer/Counter C0
;***************************************************************************
	
.equ TCC0_CTRLA = 2048		// Control  Register A
.equ TCC0_CTRLB = 2049		// Control Register B
.equ TCC0_CTRLC = 2050		// Control register C
.equ TCC0_CTRLD = 2051		// Control Register D
.equ TCC0_CTRLE = 2052		// Control Register E
.equ TCC0_INTCTRLA = 2054		// Interrupt Control Register A
.equ TCC0_INTCTRLB = 2055		// Interrupt Control Register B
.equ TCC0_CTRLFCLR = 2056		// Control Register F Clear
.equ TCC0_CTRLFSET = 2057		// Control Register F Set
.equ TCC0_CTRLGCLR = 2058		// Control Register G Clear
.equ TCC0_CTRLGSET = 2059		// Control Register G Set
.equ TCC0_INTFLAGS = 2060		// Interrupt Flag Register
.equ TCC0_TEMP = 2063		// Temporary Register For 16-bit Access
.equ TCC0_CNT = 2080		// Count
.equ TCC0_PER = 2086		// Period
.equ TCC0_CCA = 2088		// Compare or Capture A
.equ TCC0_CCB = 2090		// Compare or Capture B
.equ TCC0_CCC = 2092		// Compare or Capture C
.equ TCC0_CCD = 2094		// Compare or Capture D
.equ TCC0_PERBUF = 2102		// Period Buffer
.equ TCC0_CCABUF = 2104		// Compare Or Capture A Buffer
.equ TCC0_CCBBUF = 2106		// Compare Or Capture B Buffer
.equ TCC0_CCCBUF = 2108		// Compare Or Capture C Buffer
.equ TCC0_CCDBUF = 2110		// Compare Or Capture D Buffer

;***************************************************************************
;** TCC1 - Timer/Counter C1
;***************************************************************************
	
.equ TCC1_CTRLA = 2112		// Control  Register A
.equ TCC1_CTRLB = 2113		// Control Register B
.equ TCC1_CTRLC = 2114		// Control register C
.equ TCC1_CTRLD = 2115		// Control Register D
.equ TCC1_CTRLE = 2116		// Control Register E
.equ TCC1_INTCTRLA = 2118		// Interrupt Control Register A
.equ TCC1_INTCTRLB = 2119		// Interrupt Control Register B
.equ TCC1_CTRLFCLR = 2120		// Control Register F Clear
.equ TCC1_CTRLFSET = 2121		// Control Register F Set
.equ TCC1_CTRLGCLR = 2122		// Control Register G Clear
.equ TCC1_CTRLGSET = 2123		// Control Register G Set
.equ TCC1_INTFLAGS = 2124		// Interrupt Flag Register
.equ TCC1_TEMP = 2127		// Temporary Register For 16-bit Access
.equ TCC1_CNT = 2144		// Count
.equ TCC1_PER = 2150		// Period
.equ TCC1_CCA = 2152		// Compare or Capture A
.equ TCC1_CCB = 2154		// Compare or Capture B
.equ TCC1_PERBUF = 2166		// Period Buffer
.equ TCC1_CCABUF = 2168		// Compare Or Capture A Buffer
.equ TCC1_CCBBUF = 2170		// Compare Or Capture B Buffer

;***************************************************************************
;** AWEXC - Advanced Waveform Extension C
;***************************************************************************
	
.equ AWEXC_CTRL = 2176		// Control Register
.equ AWEXC_FDEMASK = 2178		// Fault Detection Event Mask
.equ AWEXC_FDCTRL = 2179		// Fault Detection Control Register
.equ AWEXC_STATUS = 2180		// Status Register
.equ AWEXC_STATUSSET = 2181		// Status Set Register
.equ AWEXC_DTBOTH = 2182		// Dead Time Both Sides
.equ AWEXC_DTBOTHBUF = 2183		// Dead Time Both Sides Buffer
.equ AWEXC_DTLS = 2184		// Dead Time Low Side
.equ AWEXC_DTHS = 2185		// Dead Time High Side
.equ AWEXC_DTLSBUF = 2186		// Dead Time Low Side Buffer
.equ AWEXC_DTHSBUF = 2187		// Dead Time High Side Buffer
.equ AWEXC_OUTOVEN = 2188		// Output Override Enable

;***************************************************************************
;** HIRESC - High-Resolution Extension C
;***************************************************************************
	
.equ HIRESC_CTRLA = 2192		// Control Register

;***************************************************************************
;** USARTC0 - Universal Asynchronous Receiver-Transmitter C0
;***************************************************************************
	
.equ USARTC0_DATA = 2208		// Data Register
.equ USARTC0_STATUS = 2209		// Status Register
.equ USARTC0_CTRLA = 2211		// Control Register A
.equ USARTC0_CTRLB = 2212		// Control Register B
.equ USARTC0_CTRLC = 2213		// Control Register C
.equ USARTC0_BAUDCTRLA = 2214		// Baud Rate Control Register A
.equ USARTC0_BAUDCTRLB = 2215		// Baud Rate Control Register B

;***************************************************************************
;** SPIC - Serial Peripheral Interface C
;***************************************************************************
	
.equ SPIC_CTRL = 2240		// Control Register
.equ SPIC_INTCTRL = 2241		// Interrupt Control Register
.equ SPIC_STATUS = 2242		// Status Register
.equ SPIC_DATA = 2243		// Data Register

;***************************************************************************
;** IRCOM - IR Communication Module
;***************************************************************************
	
.equ IRCOM_CTRL = 2296		// Control Register
.equ IRCOM_TXPLCTRL = 2297		// IrDA Transmitter Pulse Length Control Register
.equ IRCOM_RXPLCTRL = 2298		// IrDA Receiver Pulse Length Control Register

;***************************************************************************
;** LCD - LCD Controller 
;***************************************************************************
	
.equ LCD_CTRLA = 3328		// Control Register A
.equ LCD_CTRLB = 3329		// Control Register B
.equ LCD_CTRLC = 3330		// Control Register C
.equ LCD_INTCTRL = 3331		// Interrupt Enable Register
.equ LCD_INTFLAG = 3332		// Interrupt Flag Register
.equ LCD_CTRLD = 3333		// Control Register D
.equ LCD_CTRLE = 3334		// Control Register E
.equ LCD_CTRLF = 3335		// Control Register F
.equ LCD_CTRLG = 3336		// Control Register G
.equ LCD_CTRLH = 3337		// Control Register H
.equ LCD_DATA0 = 3344		// LCD Data Register 0
.equ LCD_DATA1 = 3345		// LCD Data Register 1
.equ LCD_DATA2 = 3346		// LCD Data Register 2
.equ LCD_DATA3 = 3347		// LCD Data Register 3
.equ LCD_DATA4 = 3348		// LCD Data Register 4
.equ LCD_DATA5 = 3349		// LCD Data Register 5
.equ LCD_DATA6 = 3350		// LCD Data Register 6
.equ LCD_DATA7 = 3351		// LCD Data Register 7
.equ LCD_DATA8 = 3352		// LCD Data Register 8
.equ LCD_DATA9 = 3353		// LCD Data Register 9
.equ LCD_DATA10 = 3354		// LCD Data Register 10
.equ LCD_DATA11 = 3355		// LCD Data Register 11
.equ LCD_DATA12 = 3356		// LCD Data Register 12
.equ LCD_DATA13 = 3357		// LCD Data Register 13
.equ LCD_DATA14 = 3358		// LCD Data Register 14
.equ LCD_DATA15 = 3359		// LCD Data Register 15
.equ LCD_DATA16 = 3360		// LCD Data Register 16
.equ LCD_DATA17 = 3361		// LCD Data Register 17
.equ LCD_DATA18 = 3362		// LCD Data Register 18
.equ LCD_DATA19 = 3363		// LCD Data Register 19


; ***** ALL MODULE BASE ADRESSES *****************************************

.equ GPIO_base = 0x0000		// General Purpose IO Registers
.equ VPORT0_base = 0x0010		// Virtual Port 0
.equ VPORT1_base = 0x0014		// Virtual Port 1
.equ VPORT2_base = 0x0018		// Virtual Port 2
.equ VPORT3_base = 0x001C		// Virtual Port 3
.equ OCD_base = 0x002E		// On-Chip Debug System
.equ CPU_base = 0x0030		// CPU Registers
.equ CLK_base = 0x0040		// Clock System
.equ SLEEP_base = 0x0048		// Sleep Controller
.equ OSC_base = 0x0050		// Oscillator Control
.equ DFLLRC32M_base = 0x0060		// DFLL for 32MHz RC Oscillator
.equ DFLLRC2M_base = 0x0068		// DFLL for 2MHz RC Oscillator
.equ PR_base = 0x0070		// Power Reduction
.equ RST_base = 0x0078		// Reset Controller
.equ WDT_base = 0x0080		// Watch-Dog Timer
.equ MCU_base = 0x0090		// MCU Control
.equ PMIC_base = 0x00A0		// Programmable Interrupt Controller
.equ PORTCFG_base = 0x00B0		// Port Configuration
.equ AES_base = 0x0C0		// AES Crypto Module
.equ CRC_base = 0x0D0		// CRC Module
.equ DMA_base = 0x0100		// DMA Controller
.equ EVSYS_base = 0x0180		// Event System
.equ NVM_base = 0x01C0		// Non Volatile Memory Controller
.equ ADCB_base = 0x0240		// Analog to Digital Converter B
.equ ACB_base = 0x0390		// Analog Comparator B
.equ RTC_base = 0x0400		// Real-Time Counter
.equ TWIC_base = 0x480		// Two-Wire Interface C
.equ USB_base = 0x4C0		// Universal Serial Bus Module
.equ PORTB_base = 0x0620		// I/O Port B
.equ PORTC_base = 0x0640		// I/O Port C
.equ PORTD_base = 0x0660		// I/O Port D
.equ PORTG_base = 0x06C0		// I/O Port G
.equ PORTM_base = 0x0760		// I/O Port M
.equ PORTR_base = 0x07E0		// I/O Port R
.equ TCC0_base = 0x800		// Timer/Counter C0
.equ TCC1_base = 0x840		// Timer/Counter C1
.equ AWEXC_base = 0x880		// Advanced Waveform Extension C
.equ HIRESC_base = 0x890		// High-Resolution Extension C
.equ USARTC0_base = 0x8A0		// Universal Asynchronous Receiver-Transmitter C0
.equ SPIC_base = 0x8C0		// Serial Peripheral Interface C
.equ IRCOM_base = 0x8F8		// IR Communication Module
.equ LCD_base = 0x0D00		// LCD Controller 


